[
  {
    "key": 0,
    "title": "Irish Police Got a Call About a Lion. It Was Actually a Dog Named Mouse.",
    "abstract": "A truck driver’s grainy video spurred bewilderment and speculation about a lion roaming in Ireland. Turns out it was a dog with an aggressive haircut.",
    "text": "A photograph released by Ireland’s police force, known as Garda Síochána, showing Mouse, the dog who was mistaken for a lion. ",
    "url": "https://www.nytimes.com/2025/11/05/world/ireland-lion-dog-mouse.html"
  },
  {
    "key": 1,
    "title": "Fire in Bosnia Rips Through Retirement Home",
    "abstract": "A blaze at a retirement home in a Bosnian city killed at least 11 people, mostly residents, according to the authorities. The cause of the fire remains undetermined.",
    "text": "The fire broke out on Tuesday evening and engulfed the top floors of a retirement home in the city of Tuzla, about 75 miles northeast of the Bosnian capital, Sarajevo. ",
    "url": "https://www.nytimes.com/video/world/europe/100000010505114/bosnia-retirement-home-fire.html"
  },
  {
    "key": 2,
    "title": "Zohran Mamdani’s Triumph in New York Evokes Intense Reaction in Israel",
    "abstract": "“The Big Apple has fallen,” a right-wing lawmaker said, reflecting broader worries in the Mideast country. Palestinians hailed the election as a sea change in the United States.",
    "text": "Zohran Mamdani at his election night event at the Paramount Theater in Brooklyn.",
    "url": "https://www.nytimes.com/2025/11/05/world/middleeast/zohran-mamdani-israel-reaction.html"
  },
  {
    "key": 3,
    "title": "Attacked by Swarm of Wasps, American Father and Son Die in Laos",
    "abstract": "Daniel Owen, 47, and his son, Cooper, 15, died after being stung dozens of times last month by what appeared to be so-called murder hornets.",
    "text": "Quality Schools International posted a statement on its Facebook account about the death of Daniel Owen, the director of its school in Haiphong, Vietnam.",
    "url": "https://www.nytimes.com/2025/11/05/world/asia/laos-wasp-attack-father-son.html"
  },
  {
    "key": 4,
    "title": "Fire at Retirement Home in Bosnia Kills at Least 11",
    "abstract": "The country’s prime minister called the blaze “a disaster of enormous proportions.” The cause was still to be determined.",
    "text": "The fire broke out on Tuesday evening and engulfed the top floors of a retirement home in the city of Tuzla, about 75 miles northeast of the Bosnian capital, Sarajevo. ",
    "url": "https://www.nytimes.com/2025/11/05/world/europe/fire-retirement-home-bosnia.html"
  },
  {
    "key": 5,
    "title": "In Russia, Bookstores Offer a Shrinking Refuge as Censorship Tightens",
    "abstract": "Restrictions on publishers and sellers have grown more severe. Volumes are being pulled from shelves or redacted like secret documents, but bookstores remain important sources of community.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/05/world/europe/russia-bookstores-refuge-censorship.html"
  },
  {
    "key": 6,
    "title": "What to Know About the Militia That Kidnapped Elizabeth Tsurkov",
    "abstract": "Kataib Hezbollah, a hard-line Iraqi militia linked to Iran, held Elizabeth Tsurkov, a citizen of Israel and Russia, hostage for more than two years.",
    "text": "A flag of the Kataib Hezbollah militia group was hoisted outside the American Embassy in Baghdad in 2019 during a protest to condemn airstrikes on their bases.",
    "url": "https://www.nytimes.com/2025/11/05/world/europe/what-to-know-about-the-militia-that-kidnapped-elizabeth-tsurkov.html"
  },
  {
    "key": 7,
    "title": "‘Strung Up and Tortured’: Hostage Recounts 2 ½ Years of Captivity",
    "abstract": "Elizabeth Tsurkov, a citizen of Israel and Russia, recounts a harrowing story of cruelty, survival, U.S. diplomatic pressure and, finally, release from the grip of a group backed by Iran.",
    "text": "Elizabeth Tsurkov, an Israeli Russian doctoral student at Princeton University, endured two and a half years of captivity in Iraq, held in solitary confinement by a militia backed by Iran.",
    "url": "https://www.nytimes.com/2025/11/05/world/middleeast/tsurkov-kataib-torture-kidnap.html"
  },
  {
    "key": 8,
    "title": "Scars in the Blue Mosque Reveal Afghanistan’s Rifts",
    "abstract": "The namesake of Mazar-i-Sharif suffered countless cracks in a 6.3-magnitude quake, but, like Afghanistan, it has endured for centuries.",
    "text": "A few passers-by examine the Blue Mosque in Mazar-i-Sharif on Monday.",
    "url": "https://www.nytimes.com/2025/11/05/world/africa/blue-mosque-afghanistan-earthquake.html"
  },
  {
    "key": 9,
    "title": "What to Know About Canada’s New Budget",
    "abstract": "The government of Prime Minister Mark Carney unveiled a program of big spending to spur Canada’s economy and reduce its dependence on the United States.",
    "text": "Prime Minister Mark Carney of Canada arriving at Parliament Hill on Tuesday in Ottawa.",
    "url": "https://www.nytimes.com/2025/11/04/world/canada/what-to-know-canada-budget.html"
  },
  {
    "key": 10,
    "title": "Drone Strike Kills Dozens of Mourners at Funeral in Sudan",
    "abstract": "The attack occurred in North Kordofan, which has seen an increased military buildup as the army and paramilitary forces jockey for control of the country.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/04/world/africa/sudan-civil-war.html"
  },
  {
    "key": 11,
    "title": "What to Know About the Legal Scandal in Israel Over Accusations of Abuse",
    "abstract": "The fallout from a legal case has reignited a highly charged debate within the country over whether Israeli soldiers accused of abusing Palestinians are held accountable.",
    "text": "The Israeli military’s former chief legal officer, Maj. Gen. Yifat Tomer-Yerushalmi, at the Supreme Court in Jerusalem in October 2014.",
    "url": "https://www.nytimes.com/2025/11/04/world/middleeast/israel-soldiers-detainee-tomer-yerushalmi.html"
  },
  {
    "key": 12,
    "title": "Elon Musk’s $1 Trillion Payday",
    "abstract": "My colleague Jack Ewing explains the stakes ahead of a crucial Tesla board meeting.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/04/world/elon-musk-trillion-dollars-election-day-venezuela-military.html"
  },
  {
    "key": 13,
    "title": "Nigeria, in Trump’s Cross Hairs, Rejects Christian Genocide Claims",
    "abstract": "Officials have accused the United States of foreign interference and called on Washington to support the country’s democracy instead of fomenting division.",
    "text": "Honoring late Pope Francis at the Holy Cross Cathedral Church in Lagos Nigeria, in April.",
    "url": "https://www.nytimes.com/2025/11/04/world/africa/nigeria-rejects-trump-christian-killings.html"
  },
  {
    "key": 14,
    "title": "TikTok and Optimism: How Rob Jetten Won Over the Netherlands",
    "abstract": "Sleek social media posts and a shift rightward on immigration helped a center-left party win last week’s election. But can its leader, Mr. Jetten, form a government?",
    "text": "The party leader of Democrats 66, Rob Jetten, the day after the Dutch parliamentary election vote.",
    "url": "https://www.nytimes.com/2025/11/04/world/europe/rob-jetten-dutch-elections.html"
  },
  {
    "key": 15,
    "title": "U.S. Seeks Two-Year U.N. Mandate for Gaza Stabilization Force",
    "abstract": "A draft Security Council resolution said that an international force would ensure that Gaza be demilitarized, though specifics were unclear.",
    "text": "Damaged buildings in Gaza City last month.",
    "url": "https://www.nytimes.com/2025/11/04/world/middleeast/un-mandate-gaza-force.html"
  },
  {
    "key": 16,
    "title": "China’s Security State Sells an A.I. Dream",
    "abstract": "China’s new national drive to embrace artificial intelligence is also giving the authorities new ways to monitor and control its citizens.",
    "text": "Security cameras in Shanghai last month.",
    "url": "https://www.nytimes.com/2025/11/04/world/asia/china-police-ai-surveillance.html"
  },
  {
    "key": 17,
    "title": "Bold Assassinations Are ‘Reality Check’ in Mexico’s Cartel Fight",
    "abstract": "The murder of Mexico’s most vocal anti-crime mayor shows that, despite President Claudia Sheinbaum’s crackdown on drug cartels, the battle is just beginning.",
    "text": "People carrying the coffin of late Mayor Carlos Manzo, who was shot on Sunday in Uruapan, a city of 350,000 in western Mexico.",
    "url": "https://www.nytimes.com/2025/11/04/world/americas/mexico-mayor-carlos-manzo-drug-war.html"
  },
  {
    "key": 18,
    "title": "Its Forces Worn Down, Ukraine Moves to Revamp Military Service",
    "abstract": "The country will introduce fixed-term military contracts to try to attract recruits and ease the strain on soldiers after years of fighting.",
    "text": "A Ukrainian soldier from an artillery unit of the 59th Assault Brigade in the Dnipropetrovsk region of eastern Ukraine last month. Until now, the country’s troops have served under open-ended contracts.",
    "url": "https://www.nytimes.com/2025/11/04/world/europe/ukraine-war-military-contracts-conscription.html"
  },
  {
    "key": 19,
    "title": "In Some Parts of Scotland, ‘The Only Thing We Need Is People’",
    "abstract": "Bucking the anti-immigration trend in British politics, remote areas of Scotland would like to attract foreign workers to offset declining local populations.",
    "text": "Workers sorting shellfish at Scot West Seafoods, in Kyle of Lochalsh, Scotland, in June.",
    "url": "https://www.nytimes.com/2025/11/04/world/europe/rural-scotland-immigration-labor-uk.html"
  }
]