[
  {
    "key": 0,
    "title": "Israel Reopens Crossing Into Northern Gaza for Aid",
    "abstract": "The cease-fire with Hamas has blunted the hunger faced by Gazans during the war. But aid agencies say Israeli restrictions are still hobbling their work.",
    "text": "Palestinians in Gaza City on a truck carrying aid from the Zikim area in August. ",
    "url": "https://www.nytimes.com/2025/11/12/world/middleeast/israel-gaza-zikim-crossing-aid.html"
  },
  {
    "key": 1,
    "title": "Northern Lights Illuminate Skies Above North America",
    "abstract": "The northern lights could be seen in skies as far south as Texas late Tuesday and early Wednesday after the sun emitted masses of charged particles that disrupted the Earth’s magnetic field — and created a dazzling display.",
    "text": "A photographer setting up at Hulah Lake to capture the northern lights in Oklahoma on Tuesday.",
    "url": "https://www.nytimes.com/video/world/americas/100000010519515/northern-lights-north-america.html"
  },
  {
    "key": 2,
    "title": "Pakistan’s Army Chief Set to Get Expanded Powers and Lifelong Immunity",
    "abstract": "A constitutional amendment in the nuclear-armed country would extend the chief’s power over all the military and brings Pakistan’s highest court under tighter political control.",
    "text": "Syed Asim Munir, 57, has had a meteoric rise through the Pakistani military’s top ranks and was named to the rare post of field marshal this spring after the country’s conflict with India.",
    "url": "https://www.nytimes.com/2025/11/12/world/asia/pakistan-army-chief-power.html"
  },
  {
    "key": 3,
    "title": "Deadly Blasts in India and Pakistan Set Region on Edge",
    "abstract": "The rare explosions in the country’s capitals have not been directly linked, but there are fears the governments will blame each other after their previous military conflict alarmed the world.",
    "text": "The blast site near the historic Red Fort in the old part of New Delhi on Monday.",
    "url": "https://www.nytimes.com/2025/11/12/world/asia/india-pakistan-explosions.html"
  },
  {
    "key": 4,
    "title": "This Diamond Sold for the Bargain Price of $25.6 Million",
    "abstract": "A 9.51-carat blue stone that once belonged to the heiress Bunny Mellon sold for $7 million less than at its last auction, a sign of profound shifts in the diamond industry.",
    "text": "The Mellon Blue at Christie’s in Geneva on Friday. ",
    "url": "https://www.nytimes.com/2025/11/12/world/europe/blue-diamond-sold-switzerland.html"
  },
  {
    "key": 5,
    "title": "Japan’s Leader Started a Meeting at 3 A.M. Then Came the Backlash.",
    "abstract": "Sanae Takaichi drew criticism for requiring staff to work in the wee hours in a country scarred by “death from overwork.”",
    "text": "Prime Minister Sanae Takaichi of Japan at a budget committee meeting in Tokyo on Wednesday.",
    "url": "https://www.nytimes.com/2025/11/12/world/asia/japan-takaichi-work-overtime.html"
  },
  {
    "key": 6,
    "title": "Syria’s Leaders Pledge to Join Fight Against Islamic State",
    "abstract": "Large parts of Syria were once overrun by the terrorist group Islamic State. The country’s new government has just committed to a global effort to fight the group.",
    "text": "President Ahmed al-Shara of Syria in Washington on Monday after a meeting with President Trump.",
    "url": "https://www.nytimes.com/2025/11/12/world/middleeast/syria-isis-islamic-state.html"
  },
  {
    "key": 7,
    "title": "Blood and Tears as Spain’s Troubled Bullfighting Star Hangs Up His Cape",
    "abstract": "José Antonio Morante Camacho says he has fought his last bull. Fans appreciated his artistry but also his honesty about his struggles with mental illness.",
    "text": "José Antonio Morante Camacho, known as Morante de La Puebla, one of Spain’s greatest bullfighters. ",
    "url": "https://www.nytimes.com/2025/11/12/world/europe/spain-bullfighting-morante-camacho.html"
  },
  {
    "key": 8,
    "title": "Turkish Military Plane Crashes in Georgia, Killing 20 Troops",
    "abstract": "The Turkish defense minister said that 20 Air Force servicemen died when their military cargo plane crashed after taking off from Azerbaijan on Tuesday.",
    "text": "Wreckage at the site where a Turkish military cargo plane crashed on Tuesday, along the border between Azerbaijan and Georgia.",
    "url": "https://www.nytimes.com/2025/11/12/world/middleeast/turkey-military-plane-crash-georgia.html"
  },
  {
    "key": 9,
    "title": "Video Shows the Moment Part of a New Bridge in China Fell",
    "abstract": "A section of the tall bridge in mountainous Sichuan Province fell, apparently after a landslide. No casualties were reported.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/12/world/asia/china-sichuan-bridge-collapse.html"
  },
  {
    "key": 10,
    "title": "Xi’s Military Purges Show Unease About China’s Nuclear Forces",
    "abstract": "The shake-up in China’s armed forces comes as both Beijing and Washington are pushing through major changes in their country’s militaries, in different ways.",
    "text": "President Trump and Melania Trump, the first lady, observing a demonstration of naval sea power this month. Mr. Trump has stood by Defense Secretary Pete Hegseth as he has fired more than a dozen military leaders, many of them people of color and women. ",
    "url": "https://www.nytimes.com/2025/11/12/world/asia/xi-trump-military-purges.html"
  },
  {
    "key": 11,
    "title": "What It Takes to Move a Factory From China to Vietnam",
    "abstract": "Tariffs have forced Chinese companies to move their operations to Vietnam. Alexandra Stevenson, our Shanghai bureau chief, visits a factory in Ho Chi Minh City to see how one of the biggest challenges isn’t relocating machinery and tools, but overcoming language barriers.",
    "text": "",
    "url": "https://www.nytimes.com/video/world/asia/100000010493279/china-vietnam-factory-manufacturing.html"
  },
  {
    "key": 12,
    "title": "Bridge in China Partially Collapses",
    "abstract": "A section of the Shuangjiangkou Hongqi Bridge in Sichuan Province, China, collapsed and sent huge plumes of dust into the air on Tuesday.",
    "text": "",
    "url": "https://www.nytimes.com/video/world/asia/100000010519324/china-sichuan-bridge-collapse.html"
  },
  {
    "key": 13,
    "title": "Key Netanyahu Minister Steps Down From Israel’s Government",
    "abstract": "Ron Dermer, a longtime ally of Prime Minister Benjamin Netanyahu and an influential figure in the Israeli government throughout the war in Gaza, resigned as minister of strategic affairs.",
    "text": "Ron Dermer, Israel’s minister of strategic affairs, during a visit to the White House, in July.",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/israel-ron-dermer-resigns-netanyahu.html"
  },
  {
    "key": 14,
    "title": "Israel Arrests 4 After Jewish Extremist Attack in Occupied West Bank",
    "abstract": "Dozens of masked Israelis attacked an industrial zone, torching vehicles and wounding Palestinians, according to Palestinian officials.",
    "text": "A truck burned after an attack in the Israeli-occupied West Bank on Tuesday.",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/israel-extremist-attack-west-bank.html"
  },
  {
    "key": 15,
    "title": "Women in Power, and on the Right",
    "abstract": "Two G7 countries now have female leaders, and they have something in common.",
    "text": "Sanae Takaichi is the first woman to serve as Japan’s prime minister. ",
    "url": "https://www.nytimes.com/2025/11/11/world/women-leaders-right-g7-pakistan-attack.html"
  },
  {
    "key": 16,
    "title": "A Trump Lawsuit Against the BBC Would Face Serious Hurdles",
    "abstract": "Legal experts say President Trump’s litigation track record offers both hope and warning to the British public broadcaster, which he has threatened with a $1 billion suit.",
    "text": "President Trump speaking to a large crowd near the White House on Jan. 6, 2021.",
    "url": "https://www.nytimes.com/2025/11/11/world/europe/trump-bbc-lawsuit-hurdles.html"
  },
  {
    "key": 17,
    "title": "Turkey Seeks 2,000-Year Jail Sentence for Erdogan’s Top Political Rival",
    "abstract": "Prosecutors accused Ekrem Imamoglu, the mayor of Istanbul, of leading a criminal organization. The opposition called the case politically motivated.",
    "text": "Mayor Ekrem Imamoglu of Istanbul was detained in March, just days before he was to be named the presidential candidate of Turkey’s opposition. ",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/istanbul-mayor-jail-sentence-turkey.html"
  },
  {
    "key": 18,
    "title": "Roman-Era Treasures Stolen From Syria’s National Museum",
    "abstract": "The Damascus museum theft set off an official investigation in what may be one of Syria’s largest losses of antiquities in recent years.",
    "text": "Syria’s National Museum in Damascus in January. The staff discovered on Monday that statues were missing.",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/syria-national-museum-roman-statues-stolen.html"
  },
  {
    "key": 19,
    "title": "India Investigates Car Blast in New Delhi as Terrorism",
    "abstract": "The National Investigation Agency, India’s lead agency for investigating terrorist attacks, has taken charge in the probe of a car explosion that killed at least eight people in a historic part of New Delhi.",
    "text": "Family and friends on Tuesday mourning a victim of the explosion in New Delhi.",
    "url": "https://www.nytimes.com/video/world/asia/100000010518176/india-explosion-new-delhi.html"
  }
]