[
  {
    "key": 0,
    "title": "Deadly Blast in Pakistan Outside Courthouse",
    "abstract": "At least 12 people died when an attacker detonated a bomb in Pakistan’s capital on Tuesday after he failed to enter a courthouse, according to the country’s interior minister.",
    "text": "Firefighters at the site of an explosion in Islamabad, Pakistan, on Tuesday.",
    "url": "https://www.nytimes.com/video/world/asia/100000010517570/deadly-explosion-court-pakistan.html"
  },
  {
    "key": 1,
    "title": "Explosion in Pakistan’s Capital Kills at Least 12",
    "abstract": "A military official accused the Pakistani Taliban of staging the attack, which took place near a courthouse in Islamabad.",
    "text": "Firefighters at the site of an explosion in Islamabad, Pakistan, on Tuesday.",
    "url": "https://www.nytimes.com/2025/11/11/world/africa/pakistan-explosion-islamabad.html"
  },
  {
    "key": 2,
    "title": "‘It Feels Like I’m in a Nightmare’: Inside the First Deportation Flight to Iran",
    "abstract": "For decades, Iranians fleeing persecution have found protection in the United States. But this fall, the Trump administration deported a planeload of people to Iran after making a deal with Tehran.",
    "text": "After an arduous journey from Iran to Turkey to Brazil to the U.S. border, Mehrdad Dalir was detained and then deported back to Iran, where he fears for his safety. ",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/iran-trump-deportation-flight.html"
  },
  {
    "key": 3,
    "title": "Modi Vows Justice as Police Suspect Terrorism in Deadly New Delhi Blast",
    "abstract": "Those responsible for the explosion “will not be spared,” Prime Minister Narendra Modi of India said. The blast killed at least eight people near a subway station at evening rush hour.",
    "text": "Security personnel at the site of an explosion near the historic Red Fort in the old quarter of New Delhi, India, on Tuesday.",
    "url": "https://www.nytimes.com/2025/11/11/world/asia/india-delhi-explosion-terror.html"
  },
  {
    "key": 4,
    "title": "Iraqis Are Voting for a New Parliament. Here’s What to Know.",
    "abstract": "Iraq is caught in the conflict between Washington and Tehran, with the Trump administration insisting that the next government disarm powerful Iran-backed militias.",
    "text": "Election workers in Baghdad counting ballots after early voting on Sunday.",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-election-what-to-know.html"
  },
  {
    "key": 5,
    "title": "How China Reached Into New York to Stop a Tiny Film Festival",
    "abstract": "A showcase for independent Chinese films was scrapped after the Chinese authorities pressured directors, moderators and even a volunteer to pull out.",
    "text": "The filmmaker Zhu Rikun looking at the IndieChina film festival poster in New York in November.",
    "url": "https://www.nytimes.com/2025/11/11/world/asia/china-film-festival-new-york.html"
  },
  {
    "key": 6,
    "title": "As Iraqis Vote for a Parliament, U.S. Presses to Rid Country of Iran’s Influence",
    "abstract": "After a U.S. occupation, years of sectarian violence and a jihadist insurgency, Iraq has become an improbable haven of calm in the Middle East.",
    "text": "Campaign posters in central Baghdad promoting candidates for the parliamentary elections.",
    "url": "https://www.nytimes.com/2025/11/11/world/middleeast/iraq-parliamentary-election-vote.html"
  },
  {
    "key": 7,
    "title": "India Is Investigating a Deadly Car Explosion. Here’s What to Know.",
    "abstract": "The car exploded near a metro station in a historic part of New Delhi on Monday night. Officials are investigating and security is tight around the region.",
    "text": "Officials inspecting the scene of a car explosion near Red Fort in New Delhi, India, on Monday.",
    "url": "https://www.nytimes.com/2025/11/10/world/asia/new-delhi-red-fort-explosion-explainer.html"
  },
  {
    "key": 8,
    "title": "How Syria’s President Transformed His Image",
    "abstract": "Syrian President Ahmed al-Shara’s meeting with President Trump in Washington signifies a new turn for al-Shara, a former Islamist rebel leader who was once designated by the United States as a terrorist with a $10 million bounty on his head. Our reporter Christina Goldbaum describes the meeting.",
    "text": "",
    "url": "https://www.nytimes.com/video/world/middleeast/100000010515338/how-syrias-president-transformed-his-image.html"
  },
  {
    "key": 9,
    "title": "Mike Smith, Bubbles on ‘Trailer Park Boys,’ Is Charged With Sexual Assault",
    "abstract": "The Canadian cult comedy series announced that Mr. Smith, 53, had “stepped away” from his role on the show.",
    "text": "Mike Smith in 2014. Mr. Smith, who plays Bubbles on the Canadian mockumentary series “Trailer Park Boys,” has been charged with sexual assault.",
    "url": "https://www.nytimes.com/2025/11/10/world/americas/trailer-park-boys-mike-smith-bubbles-sexual-assault.html"
  },
  {
    "key": 10,
    "title": "The BBC Under Fire",
    "abstract": "President Trump is threatening to sue, and that’s just one of the broadcaster’s problems.",
    "text": "The BBC’s headquarters in London.",
    "url": "https://www.nytimes.com/2025/11/10/world/bbc-trump-syria-new-delhi.html"
  },
  {
    "key": 11,
    "title": "Why the BBC Is Facing Its Gravest Crisis in Decades",
    "abstract": "The British public service broadcaster apologized on Monday for a misleadingly edited documentary about President Trump. But the scandal had already claimed two of its top executives.",
    "text": "The British Broadcasting Corporation’s current crisis is less about President Trump, than about the insoluble tensions of a public service broadcaster operating in a divided political and media world.",
    "url": "https://www.nytimes.com/2025/11/10/world/europe/bbc-news-trump.html"
  },
  {
    "key": 12,
    "title": "How Canada Lost Decades of Progress in Fighting Measles",
    "abstract": "The disease was once considered eliminated in Canada, but not any more — there have been more than 5,000 cases in the last 12 months as vaccination rates have fallen.",
    "text": "Signs describing measles symptoms at a health clinic in Taber, Alberta. The province has been a hot spot of Canada’s recent measles outbreak.",
    "url": "https://www.nytimes.com/2025/11/10/world/canada/canada-measles-what-to-know.html"
  },
  {
    "key": 13,
    "title": "Car Explodes in Crowded New Delhi Neighborhood",
    "abstract": "The authorities in India said they were investigating the cause of a blast near a busy metro station in the country’s capital that killed at least eight people and left several others injured.",
    "text": "Security personnel at the scene of an explosion near the Red Fort area of Delhi on Monday.",
    "url": "https://www.nytimes.com/video/world/100000010515652/india-explosion-new-delhi-red-fort.html"
  },
  {
    "key": 14,
    "title": "BBC Chair Apologizes After Bias Accusations",
    "abstract": "The chair of the BBC board, Samir Shah, apologized on Monday after two top executives resigned over claims of misleading editing of a speech by President Trump.",
    "text": "The BBC office, known as Broadcasting House, in London. The BBC’s output is vast, including global news, drama series and sports.",
    "url": "https://www.nytimes.com/video/world/europe/100000010515291/bbc-chair-apologizes-after-bias-accusations.html"
  },
  {
    "key": 15,
    "title": "Rescuers Search for Missing Migrants Off Malaysia’s Coast",
    "abstract": "Rescuers recovered several bodies near the site of a capsized boat carrying members of the Rohingya ethnic minority, which faces persecution in Myanmar. Another boat carrying hundreds more people was missing, too.",
    "text": "A handout photo from the Malaysian Coast Guard showing a search-and-rescue mission near the country’s border with Thailand on Sunday.",
    "url": "https://www.nytimes.com/video/world/asia/100000010515647/malaysia-rohingya-migrant-boats.html"
  },
  {
    "key": 16,
    "title": "Filipinos Reel From Destruction Left by Super Typhoon Fung-wong",
    "abstract": "Super Typhoon Fung-wong made landfall in the north of the Philippines on Sunday evening, killing at least two people and destroying about a thousand houses. The authorities had preemptively evacuated 1.3 million people.",
    "text": "Workers clear debris from a highway in Dipaculao, Philippines, on Monday, after Typhoon Fung-wong hit.",
    "url": "https://www.nytimes.com/video/world/asia/100000010515276/super-typhoon-fung-wong-philippines.html"
  },
  {
    "key": 17,
    "title": "Trump Threatens to Sue the BBC for $1 Billion After Jan. 6 Documentary",
    "abstract": "A lawyer for President Trump said the BBC’s editing of a speech he gave was “defamatory.” The broadcaster apologized on Monday for an “error in judgment.”",
    "text": "The BBC office in London. The head of the BBC and the head of news resigned after growing pressure.",
    "url": "https://www.nytimes.com/2025/11/10/world/europe/trump-bbc-lawsuit-documentary.html"
  },
  {
    "key": 18,
    "title": "Corruption Investigation Rocks the Ukrainian Government",
    "abstract": "Months after Ukraine’s president tried to cripple them, the agencies said they had uncovered a major scheme involving the state-owned nuclear energy company.",
    "text": "The headquarters of Energoatom, Ukraine’s state-owned nuclear energy company, in 2022. Anti-corruption agencies found what they said were efforts to influence Energoatom and others.",
    "url": "https://www.nytimes.com/2025/11/10/world/europe/ukraine-corruption-energy.html"
  },
  {
    "key": 19,
    "title": "Car Explodes in Crowded Delhi Neighborhood, Killing 8",
    "abstract": "India’s top security official said the cause of the blast, near the Red Fort in the capital, was still being investigated.",
    "text": "Security personnel at the scene of an explosion near the Red Fort area of Delhi on Monday.",
    "url": "https://www.nytimes.com/2025/11/10/world/asia/new-delhi-red-fort-explosion-india.html"
  }
]