[
  {
    "key": 0,
    "title": "Mail-In Ballots Solidify Narrow Win for Dutch Centrist Party",
    "abstract": "The center-left D66 party edged the far-right party of Geert Wilders in the popular vote, giving it the first crack at forming a new government.",
    "text": "The leader of the center-left party D66, Rob Jetten, in The Hague last week.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/netherlands-elections-d66-wilders.html"
  },
  {
    "key": 1,
    "title": "A Big Moment for Women in India",
    "abstract": "My colleague Mujib Mashal writes about how a huge victory on the cricket ground could change the lives of women and girls.",
    "text": "The Indian women’s team victory in the World Cup semifinal against Australia on Thursday. ",
    "url": "https://www.nytimes.com/2025/11/03/world/cricket-women-india-new-york-zohran-mamdani-bangkok.html"
  },
  {
    "key": 2,
    "title": "‘The Whole Place Is Blown Apart’: 90% of Jamaican Town’s Homes Destroyed",
    "abstract": "The devastation caused by Hurricane Melissa in Black River, Jamaica, reflects the broader destruction and rebuilding facing many Jamaican communities.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/03/world/americas/hurricane-melissa-jamaica-black-river.html"
  },
  {
    "key": 3,
    "title": "Halloween Becomes Another Target of the Kremlin’s Culture Wars",
    "abstract": "The Russian authorities canceled a festival in St. Petersburg, branding it “Satanist,” as part of a larger assault on anything viewed as a Western influence.",
    "text": "Police officers speaking to a man in costume at the Nekro Comic Con festival dedicated to Halloween in St. Petersburg, Russia, on Saturday.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/halloween-party-canceled-russia.html"
  },
  {
    "key": 4,
    "title": "What to Know About Trump’s Threat of Military Action in Nigeria",
    "abstract": "The president said he would halt all aid and go in “guns-a-blazing” to target militants.",
    "text": "At a church in Lagos, Nigeria, in April.",
    "url": "https://www.nytimes.com/2025/11/03/world/africa/trump-nigeria-military-christians.html"
  },
  {
    "key": 5,
    "title": "The Jamaican Families Torn Apart by Hurricane Melissa",
    "abstract": "Days after a powerful hurricane made landfall in Jamaica, thousands of residents are now homeless and trying to make sense of how they narrowly survived. The New York Times traveled to the storm’s center in Black River, and found a community destroyed — without food or clean water — where families are desperate and still traumatized after being cut off from the outside world.",
    "text": "",
    "url": "https://www.nytimes.com/video/world/americas/100000010495376/hurricane-melissa-damage-jamaica-black-river.html"
  },
  {
    "key": 6,
    "title": "Protesters Demand Justice After a Mayor Is Killed in Mexico",
    "abstract": "Protesters stormed a government building after Mayor Carlos Manzo of Uruapan was shot and killed while at a Day of the Dead celebration. The outspoken mayor often denounced cartels and criticized the government’s approach to dealing with them.",
    "text": "Carlos Manzo, the mayor of Uruapan, Mexico, during a recent livestream on Facebook.",
    "url": "https://www.nytimes.com/video/world/americas/100000010499270/mexico-mayor-killed-michoacan.html"
  },
  {
    "key": 7,
    "title": "U.K. Police Investigate Possible Link Between Train Attack and Stabbing of 14-Year-Old",
    "abstract": "The police are examining whether the suspect in the stabbing spree on a London-bound train on Saturday was connected to three other incidents involving a knife.",
    "text": "Photographers attempt to capture a picture of the suspected perpetrator of multiple stabbings on a train near Huntingdon, as a prison van leaves Peterborough Magistrates Court on Monday.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/uk-train-stabbing-knife-attack.html"
  },
  {
    "key": 8,
    "title": "7 Climbers Are Killed After Avalanche Hits Base Camp in Himalayas",
    "abstract": "Another four were missing, officials in Nepal said. The avalanche followed heavy snowfall produced by Cyclone Montha.",
    "text": "A search for the missing climbers was hindered by poor weather conditions on Monday that prevented helicopters from landing in the area, officials said.",
    "url": "https://www.nytimes.com/2025/11/03/world/asia/nepal-avalanche-yalung-ri-base-camp.html"
  },
  {
    "key": 9,
    "title": "The Netherlands Will Return Looted Pharoah-Era Artifact to Egypt",
    "abstract": "The 3,500-year-old artifact, likely stolen from Egypt during the Arab Spring in 2011 or 2012, was found at an elite European art fair in Maastricht.",
    "text": "A stolen artifact, a stone head from the time of the pharaohs from about 3,500 years ago, turned up at an art fair and exhibition in the Netherlands in 2022.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/ancient-egypt-sculpture-return-netherlands.html"
  },
  {
    "key": 10,
    "title": "After Fleeing a Massacre, Survivors Encountered Still More Gunfire and Abductions",
    "abstract": "Thousands of people who witnessed atrocities have tried to escape El Fasher in Sudan’s Darfur region since paramilitary fighters seized that city in late October.",
    "text": "Displaced Sudanese at the Tawila aid camp on Sunday after having fled El Fasher, a city in the Darfur region that fell the previous weekend.",
    "url": "https://www.nytimes.com/2025/11/03/world/africa/sudan-el-fasher-darfur-massacre-rsf.html"
  },
  {
    "key": 11,
    "title": "What to Know About the Louvre Heist Investigation",
    "abstract": "Three of the four people whom the police believe carried out the theft have been arrested. But the jewelry is nowhere to be found.",
    "text": "The brisk theft at the Louvre — which took place in less than 10 minutes — happened in broad daylight with visitors and museum attendants initially present in the gallery.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/louvre-museum-robbery-suspects-investigation.html"
  },
  {
    "key": 12,
    "title": "Medieval Tower Partly Collapses in Rome",
    "abstract": "The Torre dei Conti, a 13th-century medieval tower near Rome’s Colosseum, partially collapsed on Monday. Two restoration workers had to be rescued, and a third suffered critical injuries.",
    "text": "Dust rose during a second collapse at the tower on Monday.",
    "url": "https://www.nytimes.com/video/world/europe/100000010498672/torre-dei-conti-collapse-rome.html"
  },
  {
    "key": 13,
    "title": "Medieval Tower in Rome Partially Collapses, Trapping Worker Who Died After Rescue Efforts",
    "abstract": "Rescuers at the tower near the Colosseum worked for 11 hours before removing the man who had been pinned under rubble and debris. He later died in the hospital.",
    "text": "Dust rose during a second collapse at the tower on Monday.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/tower-collapse-rome-colosseum-torre-dei-conti.html"
  },
  {
    "key": 14,
    "title": "Hegseth Vows Stronger Ties With a Vietnam Skeptical of U.S. Commitment",
    "abstract": "After months of uncertainty over U.S. aid, the defense secretary pledged that Washington would keep funding programs that help address the wounds of the Vietnam War.",
    "text": "The U.S. defense secretary, Pete Hegseth, on Sunday presenting Vietnam’s defense minister, Phan Van Giang, with a knife, belt and leather box taken by U.S. soldiers from a bunker outside Da Nang, Vietnam, during the war there, in 1968.",
    "url": "https://www.nytimes.com/2025/11/03/world/asia/vietnam-war-hegseth-trip.html"
  },
  {
    "key": 15,
    "title": "Deadly Quake in Afghanistan Damages Magnificent Blue Mosque",
    "abstract": "A 6.3-magnitude earthquake struck northern Afghanistan, killing at least 20 people and injuring hundreds of others. The quake damaged one of the country’s most iconic landmarks, the 15th-century Blue Mosque.",
    "text": "Afghanistan is prone to earthquakes because it lies at the convergence of the Eurasian and Indian tectonic plates.",
    "url": "https://www.nytimes.com/video/world/asia/100000010498277/afghanistan-earthquake-blue-mosque.html"
  },
  {
    "key": 16,
    "title": "In Israel, an Unfamiliar Word Is Heard: Peace",
    "abstract": "A new kind of Mideast peace process is underway, as a determined Trump administration and its allies in the Muslim world seek to broaden a tenuous cease-fire between Israel and Hamas.",
    "text": "Israelis attend a rally on Saturday in Tel Aviv to mark the 30th anniversary of the assassination of Yitzhak Rabin.",
    "url": "https://www.nytimes.com/2025/11/03/world/middleeast/israel-hamas-peace-gaza.html"
  },
  {
    "key": 17,
    "title": "A Celebrated French Writer Loved Russia. War Forced a Reckoning.",
    "abstract": "Emmanuel Carrère’s best sellers on Russia grew out of a deep affection. Since Moscow invaded Ukraine, he has traveled to the war-torn country to rethink his views.",
    "text": "Emmanuel Carrère, one of the most celebrated nonfiction writers in France, once had a deep love for Russia.",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/emmanuel-carrere-russia-ukraine.html"
  },
  {
    "key": 18,
    "title": "The Alps Are Melting, but the Villagers Will Not Be Moved",
    "abstract": "Switzerland is racing to rebuild Blatten, which was crushed by a glacier. It’s a sign of the economic and emotional costs of a warming Europe.",
    "text": "",
    "url": "https://www.nytimes.com/2025/11/03/world/europe/switzerland-climate-change.html"
  },
  {
    "key": 19,
    "title": "With ‘a Billion’ Eyes on Them, India’s Women Lift Cricket World Cup",
    "abstract": "A team that faced seemingly insurmountable odds wins its first championship, with wider ramifications for the role women play in public life.",
    "text": "Harmanpreet Kaur and her teammates on India’s national women’s cricket team celebrate their win, right after midnight on Monday, in Mumbai, India.",
    "url": "https://www.nytimes.com/2025/11/03/world/asia/india-women-cricket-world-cup.html"
  }
]